script.yml
config:
  target: '------'
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  - name: Testing
    flow:
      - post:
          url: '/graphql'
          headers:
            "Content-Type": "application/json"
          json:
            query: "query { viewer { login } }"
      - log: "Response Body: {{ response.body }}"
      
      - post:
          url: '/graphql'
          headers:
            "Content-Type": "application/json"
          json:
            query: "query GetUsers($first: Int!, $after: String) { users(first: $first, after: $after) { pageInfo { hasNextPage endCursor } edges { node { id name email } cursor } } }"
            variables:
              first: 1
              after: null
          capture:
              json: "$.data.users.edges[0].node.id"
              as: "userId"
      - log: "Request Variables 11 : userId={{ userId }}"
      - log: "Request Body 11: {{ JSON.stringify(request.body) }}"

      - get: 
          url: 'm/graphql'
          headers:
            "Content-Type": "application/json"
          json:
            query: "query GetUser($id: ID!) { user(id: $id) { id name email } }"
            variables: 
              id: "{{ userId }}"
      - log: "Request Variables 22 : userId={{ userId }}"
      - log: "Request Body 22: {{ JSON.stringify(request.body) }}"